select заказы.код as код ,
(материалы.цена*тип_одежды.сложность*заказы.уровень_качества*(1-скидки.скидка))
as цена from заказы inner join тип_одежды 
on заказы.тип_одежды_код = тип_одежды.код inner join материалы
on заказы.материалы_код = материалы.код inner join скидки 
on заказы.скидки_код = скидки.код;

select заказы.код as код ,
(материалы.цена*тип_одежды.сложность*заказы.уровень_качества)- 
(материалы.цена*тип_одежды.сложность*заказы.уровень_качества*(1-скидки.скидка))
as скидка from заказы inner join тип_одежды 
on заказы.тип_одежды_код = тип_одежды.код inner join материалы
on заказы.материалы_код = материалы.код inner join скидки 
on заказы.скидки_код = скидки.код

select * from заказы ;

select фамилия from мастера where уровень_мастера = 5;

select фамилия, round((datediff(curdate(), дата_начала)/365),0)
as стаж from мастера;

select concat(фамилия," ",имя," ",отчество)as ФИО
from клиенты;


select код,дата_начала,заказы_код as заказы
from работа where 
мастера_код = (select код from мастера where уровень_мастера = 3);

select count(*) as количество_заказов from заказы;

select
sum((материалы.цена*тип_одежды.сложность*заказы.уровень_качества*(1-скидки.скидка)))
as сумма from заказы inner join тип_одежды 
on заказы.тип_одежды_код = тип_одежды.код inner join материалы
on заказы.материалы_код = материалы.код inner join скидки 
on заказы.скидки_код = скидки.код;

select фамилия, имя, отчество from мастера
where фамилия like 'П%';

select заказы.код as код_заказа, материалы.название as материалы
from заказы inner join материалы
on заказы.материалы_код = материалы.код;